{
  "Fairways": {
    "count": 57,
    "values": [
      0.8,
      1,
      1.0,
      0.5,
      0.5,
      1,
      1.0,
      1,
      1.0,
      0.8,
      1,
      0.5,
      0.5,
      1,
      1.0,
      1,
      1.0,
      0.5,
      0.5,
      0.8,
      1,
      1.0,
      0.5,
      0.5,
      1.0,
      1,
      0.8,
      0.5,
      0.5,
      -0.2,
      1,
      1.0,
      1,
      1.0,
      0.8,
      0.8,
      0.5,
      0.5,
      1,
      0.5,
      1.0,
      0.8,
      1.0,
      1.0,
      1.0,
      1,
      1.0,
      0.8,
      1,
      1.0,
      1.0,
      0.5,
      0.5,
      1.0,
      0.8,
      1,
      1.0
    ],
    "review_texts": [
      "Overall conditions were good. Fairways were nice greens were a touch slow but in good shape . Great value and very friendly staff",
      "Course is in great shape overall and staff is friendly. Only drawback is that the bunkers only have about an inch of sand then you hit clay.",
      "Great golf course drove 1 1/2 hours play and was not disappointed,  fairways and greens in Great shape,  awesome staff",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Played with my daughter great course in grate shape",
      "Fairways and greens were in great shape and the people were awesome",
      "First to the Grounds Super and Crew… outstanding job! This is a very nice course in great shape. It’s easy to tell that this maintenance crew knows what they are doing and the course played spectacular tee to green. Now to the problems. The staff was very rude and unprofessional. The locals had set up a party literally just a couple of yards off the 18th green and wouldn’t move. We waited for a while and gestured for them to move so that we could hit , bit they wouldn’t. They just became very loud and boisterous so we just picked up and left without finishing or making things worse. It was too bad because everyone was playing well and we were all within a couple of strokes apart Not being able to finish our round was very disappointing. I’ll never go back here as there are so many other options.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Pace of play was a tad slow but not enough to ruin the round. Course was in great shape. Greens rolled true and fairways were solid. Would play again.",
      "thank you for allowing us to enjoy this well maintained, beautiful course.",
      "Located on the North shore of Lake Marion course is about an hour drive but well worth the trip. Fairway grass was dormant but well cut, rough was dormant and cut just enough to make finding the short grass meaningful. Between loose leave and light brown rough , balls in the rough were sometimes hard to find. Green were in good shape, rolled true and were on the fast side. Staff was very friendly.. Thoroughly enjoyed the round. This is a course that I want to go back to when things are green and growing.",
      "Played the course in very windy, cold, and wet conditions. Brutal round due to conditions but course was in good shape. Greens and fairways were in good shape for all the rain the area has had. Would play again and would recommend.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Course was in fantastic shape. Staff was very friendly and helpful. Fairways and greens were in fastastic shape. Highly recommend this course to anyone in the area.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Great layout. Fairways in excellent condition. Greens had been recently plugged. Would like to play it again when greens are completely healed. Enjoyed he course very much. Bunkers needed a lot of work.",
      "Golf now did not flag course maintenance. Besides greens being worked on course was in good shape. Played here before and will play here again",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "Fairly forgiving but not boring course. In fine condition, and rates have plummeted as tourist season moves into lowcountry hot season. Not located near anywhere, but worth a longer drive than you might be used to.",
      "Played course a couple times a year Not many homes on course open fairways, but difficult greens",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "I love playing this course. Club does a great job keeping this course in playing condition. I have now played it about a dozen times and never have been disappointed.",
      "Good condition, good fairways and greens for this time of year. FRIENDLY STAFF",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Wyboo is always in great shape. Well worth the trip!",
      "This is one of our favorite courses. Fairways are lush and greens roll great!",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "Fairways and greens were in excellent condition. We play a lot of different courses in the area and this one was the best we played this year. Course was not busy at all.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "Course is in very good condition, all the greens and fairways were in good shape. Great value for the money at this time of year.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "We played 36 holes and had a ball. Everyone was very nice and the course was in FINE shape for this time of year.",
      "Well maincured greens and fairways, rough was a little tall. The course was busy but speed of play was good. Electric carts a plus. Would enjoy playing this course again with family and friends.",
      "course was fun to play and was in good condition, they had just over seeded",
      "I seldom give a course a 5 star rating but Wyboo deserves it ! Fairways and Greens were in fabulous condition, i saw no areas that were in need of attention.",
      "wide fairways, plenty of water, greens in really good shape for the time of year, a great deal, a great day!",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "I shot an 89 my second time playing this course. I love the greens and the way they hold good shots and how they putt. I shot 7 to 10 shots better than I have been scoring on some other courses. The fairways are in great shape too. It is just a very nice golf course.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Really enjoyed playing this course, actually have booked another tee time for this week. The fairways and greens were really well kept.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "First time playing Wyboo and was very impressed by the layout and condition of the course. The natural landscape bordering the fairways significantly added to the beauty of the course. Nice to not see houses lining every fairway. Highly recommend this course and certainly will play it again.",
      "I have played every course in the area, but haven't played this one since it first opened years ago. Let me tell you, It is in awesome shape. Greens were perfect ( about a 10/11 0n the stimp meter. Fairways were perfect. Not too wide, not too narrow. I shot my 2nd lowest score of the year. I'm going back next weekend.",
      "The greens were in fantastic shape and the fairways were also in excellent condition. For the money, this is the best course I have ever played! Highly recommended.",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Recommend It was a really nice layout and the course was in great shape.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back."
    ]
  },
  "Greens": {
    "count": 104,
    "values": [
      0.5,
      -1,
      1,
      1.0,
      0.5,
      1.0,
      1.0,
      -0.5,
      1,
      1,
      1.0,
      1.0,
      1,
      -0.2,
      1.0,
      1.0,
      0.9,
      1.0,
      1.0,
      0.8,
      1,
      -0.5,
      1.0,
      0.9,
      1.0,
      1.0,
      1.0,
      1.0,
      1,
      -0.5,
      -0.5,
      -0.5,
      0.8,
      0,
      0.5,
      0.8,
      0.5,
      1,
      1.0,
      1,
      1.0,
      -0.5,
      -0.5,
      0.7,
      1,
      1.0,
      0.5,
      -0.5,
      1.0,
      1.0,
      -0.5,
      0.5,
      1.0,
      -0.5,
      1.0,
      1,
      0.5,
      0.8,
      1.0,
      1,
      0.5,
      -0.2,
      1,
      1.0,
      1,
      1.0,
      0.5,
      0.8,
      1.0,
      0.8,
      0.5,
      1,
      0.5,
      0.5,
      0.5,
      1.0,
      0.9,
      0.8,
      -0.2,
      1.0,
      1.0,
      1,
      1.0,
      0.9,
      1.0,
      1.0,
      1.0,
      0.5,
      -0.5,
      1.0,
      1.0,
      -0.2,
      1.0,
      1.0,
      -0.5,
      1.0,
      0.8,
      1.0,
      -0.5,
      1,
      1.0,
      1.0,
      0.5,
      1.0
    ],
    "review_texts": [
      "Overall conditions were good. Fairways were nice greens were a touch slow but in good shape . Great value and very friendly staff",
      "Some of the slowest greens in the universe. I never putted on so slow of green in my life.",
      "Course is in great shape overall and staff is friendly. Only drawback is that the bunkers only have about an inch of sand then you hit clay.",
      "Great golf course drove 1 1/2 hours play and was not disappointed,  fairways and greens in Great shape,  awesome staff",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "For December the course was in great shape. Tees over seeded with rye and greens green and receptive. Very challenging layout yet fair for all levels of players.",
      "This hidden gem is well worth the short ride from I-95 The course was well maintained Wwth a pretty and fair layout using four different tee boxes. Greens are in excellent condition and were very Consistent throughout. Great value and great experience. Friendly people.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Friendly staff, course in great conditions and greens in great condition. I would definitely play this course again.",
      "Played with my daughter great course in grate shape",
      "Fairways and greens were in great shape and the people were awesome",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "A lovely course that was excellent value for money. Having played some big name courses in South Carolina, playing Wyboo was enjoyable. Some well designed holes that kept the round interesting. The greens were excellent and even though we had a splash of rain, the greens could take the moisture and putted perfectly. Worth a visit in the area.",
      "This was my second time playing this course and it impressed me more this time around. This course has amazing greens and great layout and combination of par 3's 4's and 5's! It offer some challenges to the experienced golfer yet is forgiving enough to not push away beginners.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "Green roll verty Well and the course is in good shape.",
      "First to the Grounds Super and Crew… outstanding job! This is a very nice course in great shape. It’s easy to tell that this maintenance crew knows what they are doing and the course played spectacular tee to green. Now to the problems. The staff was very rude and unprofessional. The locals had set up a party literally just a couple of yards off the 18th green and wouldn’t move. We waited for a while and gestured for them to move so that we could hit , bit they wouldn’t. They just became very loud and boisterous so we just picked up and left without finishing or making things worse. It was too bad because everyone was playing well and we were all within a couple of strokes apart Not being able to finish our round was very disappointing. I’ll never go back here as there are so many other options.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "Pace of play was a tad slow but not enough to ruin the round. Course was in great shape. Greens rolled true and fairways were solid. Would play again.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "We have played Wyboo many times. It was in excellent shape, especially since it has been so dry. Greens have been redone and are in great shape.",
      "The new greens are fantastic true roll. I hope they can continue to keep these greens in such good shape.",
      "Their new greens are filled in and putting great/true. I’d say the best around at this time.",
      "thank you for allowing us to enjoy this well maintained, beautiful course.",
      "Staff was very friendly and helpful. The only issue was that they were redoing the greens so they did a make shift for now. They did tell us this before we started. They did tell us that it would be back to normal by next week. We willl return as it is a really good course",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "We played the course during a time when the greens were under construction. They have tiny temporary green set up with large cups. The overall course was beautiful! It played nicely. I just wish for the price we paid we’d have been informed prior to purchasing that the course was undergoing renovation.",
      "After a short rain delay, my husband and I really enjoyed playing here. Considering that there hasn't been much rain lately, the course was in good condition and the greens were quick as expected. Course was challenging and pace of play was great! This was the 1st time playing this course and we'll definitely be back!",
      "I played in March, early spring. Greens were only ok. Course is fairly basic - not a lot of trouble. Pace of play was very good.",
      "Fun,well designed course with interesting holes that required strategic shot selection. We were told in the clubhouse that the greens were going to be redone this summer.They rolled true but were on the smallish side.",
      "Located on the North shore of Lake Marion course is about an hour drive but well worth the trip. Fairway grass was dormant but well cut, rough was dormant and cut just enough to make finding the short grass meaningful. Between loose leave and light brown rough , balls in the rough were sometimes hard to find. Green were in good shape, rolled true and were on the fast side. Staff was very friendly.. Thoroughly enjoyed the round. This is a course that I want to go back to when things are green and growing.",
      "Played the course in very windy, cold, and wet conditions. Brutal round due to conditions but course was in good shape. Greens and fairways were in good shape for all the rain the area has had. Would play again and would recommend.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Course was in fantastic shape. Staff was very friendly and helpful. Fairways and greens were in fastastic shape. Highly recommend this course to anyone in the area.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Great layout. Fairways in excellent condition. Greens had been recently plugged. Would like to play it again when greens are completely healed. Enjoyed he course very much. Bunkers needed a lot of work.",
      "Golf now did not flag course maintenance. Besides greens being worked on course was in good shape. Played here before and will play here again",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "The greens were recently punched and covered in sand, so putting was impossible, BUT it stated that on GolfNow before we booked. Very neat course with a nice layout. I would like to go back and play when the greens are normal.",
      "Love to play this course. It's an hour ride away from me but I don't mind the drive for a good course. The layout is great, the greens are always in good shape. Great value for the price. I played this course for $23 but would've paid $50 and still would be a good price. I have played high priced courses in the Charleston area that pale to comparison to this course.",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff",
      "Played course a couple times a year Not many homes on course open fairways, but difficult greens",
      "Played over the weekend for the first time and was excited since I have been told by numerous people that Wyboo is the best course in the Santee Cooper Region. It's in the Top 3 of the courses I have played in the area. Very little undulation on the greens makes it easier for armatures, but layout makes if challenging for good golfers.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "Had a lot of fun playing this course. The course is very well maintained. The greens are quick and in great shape. Really nice lay out. Staff is great and super friendly.",
      "I love playing this course. Club does a great job keeping this course in playing condition. I have now played it about a dozen times and never have been disappointed.",
      "Course is in great shape considering all the rain - greens are tricky!",
      "Good condition, good fairways and greens for this time of year. FRIENDLY STAFF",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "I would recommend this course. The course is in great shape and the greens are pure",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Wyboo is always in great shape. Well worth the trip!",
      "This is one of our favorite courses. Fairways are lush and greens roll great!",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "Fairways and greens were in excellent condition. We play a lot of different courses in the area and this one was the best we played this year. Course was not busy at all.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "Course is in very good condition, all the greens and fairways were in good shape. Great value for the money at this time of year.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "We enjoyed the course very much - it had some challenging holes - the greens were very smooth, even though it's off season. The only thing that we can think of to look after - there was little or no water in the ball washers on the course and the drying towels are very old and filthy. Little things like this get noticed and it doesn't take money or hard labor to rectify this. Overall though, we had a great time and look forward to a return visit.",
      "We played 36 holes and had a ball. Everyone was very nice and the course was in FINE shape for this time of year.",
      "Well maincured greens and fairways, rough was a little tall. The course was busy but speed of play was good. Electric carts a plus. Would enjoy playing this course again with family and friends.",
      "Staff was super friendly. Had some interesting holes, with small challenging greens. Course was in good shape for this time of year.",
      "Greens were overseeded, but other than that the course is in great shape!",
      "course was fun to play and was in good condition, they had just over seeded",
      "I seldom give a course a 5 star rating but Wyboo deserves it ! Fairways and Greens were in fabulous condition, i saw no areas that were in need of attention.",
      "wide fairways, plenty of water, greens in really good shape for the time of year, a great deal, a great day!",
      "For those willing to make the 1 1/2 hour or so drive from the Charleston area for a different golfing experience, this is the place to go. The course was very well maintained and the pace of play was better than most, especially considering that we played on a holiday weekend. The greens were a bit slower than average but were in very good condition. This is NOT a pumpkin patch golf course... it would fit in beautifully in any setting in the Charleston area. But then the cost to play would go up signifcantly! Do yourself and your wallet a favor. Get three golf buddies and make the trip to Wyboo. I'm sure you'll be impressed with the quality of the course and the great value!",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "I shot an 89 my second time playing this course. I love the greens and the way they hold good shots and how they putt. I shot 7 to 10 shots better than I have been scoring on some other courses. The fairways are in great shape too. It is just a very nice golf course.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Really enjoyed playing this course, actually have booked another tee time for this week. The fairways and greens were really well kept.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "Tee to green is very forgiving if your a 10-15 handicap. This time of season the rough is shorter and makes for easier chip/pitch shots to get close. Greens were awesome. Really held the ball when properly struck. Had a great time and will go back soon. Charleston needs to hire this greens keeper and crew.",
      "I have played every course in the area, but haven't played this one since it first opened years ago. Let me tell you, It is in awesome shape. Greens were perfect ( about a 10/11 0n the stimp meter. Fairways were perfect. Not too wide, not too narrow. I shot my 2nd lowest score of the year. I'm going back next weekend.",
      "The greens were in fantastic shape and the fairways were also in excellent condition. For the money, this is the best course I have ever played! Highly recommended.",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "This was my second time playing this course and it impressed me more this time around. This course has amazing greens and great layout and combination of par 3's 4's and 5's! It offer some challenges to the experienced golfer yet is forgiving enough to not push away beginners.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "Recommend It was a really nice layout and the course was in great shape.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff"
    ]
  },
  "Bunkers": {
    "count": 11,
    "values": [
      -0.5,
      0.2,
      0.5,
      -1.0,
      0.8,
      0.5,
      0.5,
      0.5,
      -0.5,
      1,
      0.2
    ],
    "review_texts": [
      "Course is in great shape overall and staff is friendly. Only drawback is that the bunkers only have about an inch of sand then you hit clay.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Great layout. Fairways in excellent condition. Greens had been recently plugged. Would like to play it again when greens are completely healed. Enjoyed he course very much. Bunkers needed a lot of work.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again."
    ]
  },
  "Tee Boxes": {
    "count": 18,
    "values": [
      0.5,
      1.0,
      1.0,
      1.0,
      -0.5,
      1,
      1,
      1.0,
      1.0,
      1,
      1,
      0.8,
      1,
      0.5,
      1.0,
      -0.5,
      1,
      1.0
    ],
    "review_texts": [
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "For December the course was in great shape. Tees over seeded with rye and greens green and receptive. Very challenging layout yet fair for all levels of players.",
      "This hidden gem is well worth the short ride from I-95 The course was well maintained Wwth a pretty and fair layout using four different tee boxes. Greens are in excellent condition and were very Consistent throughout. Great value and great experience. Friendly people.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Course was in great shape. Greens were fast and firm. Tees and fairways were also in great shape. We were staying in Santee and the 25 minute drive is more than worth it to play here.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back."
    ]
  },
  "Shot Variety / Hole Uniqueness": {
    "count": 51,
    "values": [
      1.0,
      0.5,
      1.0,
      1,
      0.5,
      0.5,
      1.0,
      0.7,
      0.5,
      0.8,
      0.5,
      -0.5,
      0.8,
      0.5,
      -0.2,
      0.5,
      0.7,
      0.5,
      1,
      0.5,
      0.5,
      0.5,
      1.0,
      0.5,
      1.0,
      0.5,
      0.5,
      1,
      1.0,
      1.0,
      0.5,
      1,
      0.7,
      0.5,
      0.5,
      1,
      0.5,
      0.5,
      0.5,
      0.0,
      0.5,
      1,
      1,
      1.0,
      0.5,
      0.5,
      0.8,
      0.5,
      -0.2,
      0.5,
      0.5
    ],
    "review_texts": [
      "Great condition and a very good layout for all different skilled players !! Thanks for a memorable day !!",
      "Our group of 17 had a great time. Very fair but not easy layout. Very good conditions and the people in the Pro Shop and Snack Bar were great!",
      "For December the course was in great shape. Tees over seeded with rye and greens green and receptive. Very challenging layout yet fair for all levels of players.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "A lovely course that was excellent value for money. Having played some big name courses in South Carolina, playing Wyboo was enjoyable. Some well designed holes that kept the round interesting. The greens were excellent and even though we had a splash of rain, the greens could take the moisture and putted perfectly. Worth a visit in the area.",
      "This was my second time playing this course and it impressed me more this time around. This course has amazing greens and great layout and combination of par 3's 4's and 5's! It offer some challenges to the experienced golfer yet is forgiving enough to not push away beginners.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape",
      "It was a really nice layout and the course was in great shape.",
      "Nice layout and price cannot be beat. Will go back again",
      "I played in March, early spring. Greens were only ok. Course is fairly basic - not a lot of trouble. Pace of play was very good.",
      "Fun,well designed course with interesting holes that required strategic shot selection. We were told in the clubhouse that the greens were going to be redone this summer.They rolled true but were on the smallish side.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Great course, lay out was easy to play as it being our first time there. We started on the back nine and it felt like it was our personal course. Did not see anyone to the 17th hole. Would definitely play there again.",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This course was a great surprise.Great layout and in good shape for the time of year.Pacewas average but still okay.Would definitely play again and highly recommend.",
      "Enjoyed playing this course. Well maintained, somewhat challenging, friendly staff.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "The greens were recently punched and covered in sand, so putting was impossible, BUT it stated that on GolfNow before we booked. Very neat course with a nice layout. I would like to go back and play when the greens are normal.",
      "Love to play this course. It's an hour ride away from me but I don't mind the drive for a good course. The layout is great, the greens are always in good shape. Great value for the price. I played this course for $23 but would've paid $50 and still would be a good price. I have played high priced courses in the Charleston area that pale to comparison to this course.",
      "Fairly forgiving but not boring course. In fine condition, and rates have plummeted as tourist season moves into lowcountry hot season. Not located near anywhere, but worth a longer drive than you might be used to.",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff",
      "Played over the weekend for the first time and was excited since I have been told by numerous people that Wyboo is the best course in the Santee Cooper Region. It's in the Top 3 of the courses I have played in the area. Very little undulation on the greens makes it easier for armatures, but layout makes if challenging for good golfers.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "Had a lot of fun playing this course. The course is very well maintained. The greens are quick and in great shape. Really nice lay out. Staff is great and super friendly.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "We enjoyed the course very much - it had some challenging holes - the greens were very smooth, even though it's off season. The only thing that we can think of to look after - there was little or no water in the ball washers on the course and the drying towels are very old and filthy. Little things like this get noticed and it doesn't take money or hard labor to rectify this. Overall though, we had a great time and look forward to a return visit.",
      "I play every weekend using golf now I have to say I really wish this course was close to me I would spend most of my weekends there. If you are considering this course for the first time go I can't describe it we'll enough for you but you will most definitely enjoy it. It was beautifully maintained and loved the course layout.",
      "Staff was super friendly. Had some interesting holes, with small challenging greens. Course was in good shape for this time of year.",
      "course was fun to play and was in good condition, they had just over seeded",
      "A bit out of the way but worth the drive. A fun course that is playable for the average golfer. Course was in great condition.",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "First time playing Wyboo and was very impressed by the layout and condition of the course. The natural landscape bordering the fairways significantly added to the beauty of the course. Nice to not see houses lining every fairway. Highly recommend this course and certainly will play it again.",
      "This was my second time playing this course and it impressed me more this time around. This course has amazing greens and great layout and combination of par 3's 4's and 5's! It offer some challenges to the experienced golfer yet is forgiving enough to not push away beginners.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape",
      "Recommend It was a really nice layout and the course was in great shape.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff"
    ]
  },
  "Signature Holes / Quirky/Fun Design Features": {
    "count": 7,
    "values": [
      1,
      0.5,
      0.7,
      0.5,
      0.5,
      1,
      0.5
    ],
    "review_texts": [
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape",
      "Fun,well designed course with interesting holes that required strategic shot selection. We were told in the clubhouse that the greens were going to be redone this summer.They rolled true but were on the smallish side.",
      "course was fun to play and was in good condition, they had just over seeded",
      "A bit out of the way but worth the drive. A fun course that is playable for the average golfer. Course was in great condition.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "This is a fun course, some challenging holes , nice layout. Greens we're in great shape"
    ]
  },
  "Water & OB Placement": {
    "count": 12,
    "values": [
      0.5,
      0.5,
      -0.5,
      0.5,
      0.5,
      0.0,
      0.5,
      0.7,
      0.5,
      1,
      0.5,
      0.5
    ],
    "review_texts": [
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "wide fairways, plenty of water, greens in really good shape for the time of year, a great deal, a great day!",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  },
  "Overall feel / Scenery": {
    "count": 99,
    "values": [
      0.5,
      1,
      1,
      1.0,
      0.5,
      -0.5,
      1.0,
      1,
      1.0,
      1,
      0.5,
      1,
      0.5,
      1.0,
      1.0,
      0.5,
      0.8,
      1,
      1.0,
      1.0,
      0.8,
      0.5,
      1,
      0.5,
      0.5,
      0.8,
      0.7,
      0.5,
      0.7,
      0.5,
      0.5,
      0.5,
      1,
      1.0,
      1.0,
      0.5,
      0.8,
      1.0,
      0.9,
      1.0,
      0.5,
      1,
      1.0,
      0.5,
      0.8,
      0.5,
      0.5,
      0.5,
      0.5,
      0.5,
      1,
      1.0,
      1,
      1,
      0.5,
      1.0,
      0.5,
      0.8,
      1.0,
      1,
      1,
      1,
      0.9,
      0.5,
      0.7,
      0.5,
      1.0,
      1,
      0.5,
      1.0,
      1.0,
      0.5,
      0.9,
      0.5,
      1.0,
      0.8,
      1,
      1.0,
      1,
      0.7,
      1,
      1,
      0.5,
      1.0,
      0.5,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8,
      0.5,
      0.5,
      0.5,
      0.5,
      0.5,
      0.5,
      1.0,
      1.0,
      0.5
    ],
    "review_texts": [
      "Love playing this course.  They have cut down trees al over the course to open it up more.",
      "Course is in great shape overall and staff is friendly. Only drawback is that the bunkers only have about an inch of sand then you hit clay.",
      "They call it a hidden gem and that pretty much sums it up.",
      "Great condition and a very good layout for all different skilled players !! Thanks for a memorable day !!",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "Called for tee times but ran in to many member groups (custom carts)out playing back nine causing delays each hole . They obviously started on back nine which apparently management allowed. Why call for tee times when you can not play through at the turn in the order you started the round? Course was not in very good shape overall.",
      "This hidden gem is well worth the short ride from I-95 The course was well maintained Wwth a pretty and fair layout using four different tee boxes. Greens are in excellent condition and were very Consistent throughout. Great value and great experience. Friendly people.",
      "Played with my daughter great course in grate shape",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Love the course and it's layout. Hope to play next year Regards",
      "A lovely course that was excellent value for money. Having played some big name courses in South Carolina, playing Wyboo was enjoyable. Some well designed holes that kept the round interesting. The greens were excellent and even though we had a splash of rain, the greens could take the moisture and putted perfectly. Worth a visit in the area.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "Green roll verty Well and the course is in good shape.",
      "This was our first time playing this course. Although it was November 2, and considered \"late\" in the season, the course was in very good condition! We will definitely put this one on our return to play list.",
      "First to the Grounds Super and Crew… outstanding job! This is a very nice course in great shape. It’s easy to tell that this maintenance crew knows what they are doing and the course played spectacular tee to green. Now to the problems. The staff was very rude and unprofessional. The locals had set up a party literally just a couple of yards off the 18th green and wouldn’t move. We waited for a while and gestured for them to move so that we could hit , bit they wouldn’t. They just became very loud and boisterous so we just picked up and left without finishing or making things worse. It was too bad because everyone was playing well and we were all within a couple of strokes apart Not being able to finish our round was very disappointing. I’ll never go back here as there are so many other options.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "It was a really nice layout and the course was in great shape.",
      "Enjoyed the course. Pace little slow but was a holiday weekend.",
      "thank you for allowing us to enjoy this well maintained, beautiful course.",
      "Staff was very friendly and helpful. The only issue was that they were redoing the greens so they did a make shift for now. They did tell us this before we started. They did tell us that it would be back to normal by next week. We willl return as it is a really good course",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "We played the course during a time when the greens were under construction. They have tiny temporary green set up with large cups. The overall course was beautiful! It played nicely. I just wish for the price we paid we’d have been informed prior to purchasing that the course was undergoing renovation.",
      "After a short rain delay, my husband and I really enjoyed playing here. Considering that there hasn't been much rain lately, the course was in good condition and the greens were quick as expected. Course was challenging and pace of play was great! This was the 1st time playing this course and we'll definitely be back!",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "Located on the North shore of Lake Marion course is about an hour drive but well worth the trip. Fairway grass was dormant but well cut, rough was dormant and cut just enough to make finding the short grass meaningful. Between loose leave and light brown rough , balls in the rough were sometimes hard to find. Green were in good shape, rolled true and were on the fast side. Staff was very friendly.. Thoroughly enjoyed the round. This is a course that I want to go back to when things are green and growing.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Great course, lay out was easy to play as it being our first time there. We started on the back nine and it felt like it was our personal course. Did not see anyone to the 17th hole. Would definitely play there again.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Great layout. Fairways in excellent condition. Greens had been recently plugged. Would like to play it again when greens are completely healed. Enjoyed he course very much. Bunkers needed a lot of work.",
      "Golf now did not flag course maintenance. Besides greens being worked on course was in good shape. Played here before and will play here again",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "This is a great course and a fun track. We liked the conditioning and layout so much that we went back to Wyboo in our short, four-day trip. We played another course on our last day, but felt that Wyboo was soooooo much better that we left after just one round (we normally play 2-3 rounds on the same course) and went back to Wyboo.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This is a hidden gem. To me, this is the nicest course I have ever played. But the only way I can play Wyboo is if I book it through GolfNow or TeeOff.com. On a pastors salary, I can't pay full price. Playing golf is such a great stress relief for me as a pastor. Thankful for the opportunity to have played Wyboo now for the 5th time.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "This course was a great surprise.Great layout and in good shape for the time of year.Pacewas average but still okay.Would definitely play again and highly recommend.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "Enjoyed playing this course. Well maintained, somewhat challenging, friendly staff.",
      "We really have enjoyed this course. This is the second time we have played this course, the first time was a few years ago. We decided in the last minute to head south for a overnight trip. Everyone treated us very nice and the course was in very nice shape. A little wet in a few spots but that was not the courses fault. We will be back again. Nice job Wyboo.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "We played this course while visiting friends and it was a pleasant surprise. Everyone was friendly and we were really impressed with the decked out golf carts. We will definitely visit this course again when we are in that area!",
      "The greens were recently punched and covered in sand, so putting was impossible, BUT it stated that on GolfNow before we booked. Very neat course with a nice layout. I would like to go back and play when the greens are normal.",
      "Fairly forgiving but not boring course. In fine condition, and rates have plummeted as tourist season moves into lowcountry hot season. Not located near anywhere, but worth a longer drive than you might be used to.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "Had a lot of fun playing this course. The course is very well maintained. The greens are quick and in great shape. Really nice lay out. Staff is great and super friendly.",
      "I love playing this course. Club does a great job keeping this course in playing condition. I have now played it about a dozen times and never have been disappointed.",
      "I play this course 2 or 3 times a month and I have to drive 50 miles to get there. It is always in great shape and the price is very reasonable.",
      "Last day of February. Course was in nice shape. Pro shop staff extremely friendly.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Great course. Staff very friendly and helpful. Conditions were fantastic.",
      "Wyboo is always in great shape. Well worth the trip!",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "This place is a hidden gem. Well worth the money and time. I only wish it was closer to where I live because I would play every week.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "We enjoyed the course very much - it had some challenging holes - the greens were very smooth, even though it's off season. The only thing that we can think of to look after - there was little or no water in the ball washers on the course and the drying towels are very old and filthy. Little things like this get noticed and it doesn't take money or hard labor to rectify this. Overall though, we had a great time and look forward to a return visit.",
      "We played 36 holes and had a ball. Everyone was very nice and the course was in FINE shape for this time of year.",
      "Tucked away with no noise except nature. Relaxing.",
      "I play every weekend using golf now I have to say I really wish this course was close to me I would spend most of my weekends there. If you are considering this course for the first time go I can't describe it we'll enough for you but you will most definitely enjoy it. It was beautifully maintained and loved the course layout.",
      "Staff was super friendly. Had some interesting holes, with small challenging greens. Course was in good shape for this time of year.",
      "A great course with a welcome feel. The gentleman behind the counter on 10/30/13 couldn't have been nicer or more accommodating. We'll be back for sure!",
      "Greens were overseeded, but other than that the course is in great shape!",
      "course was fun to play and was in good condition, they had just over seeded",
      "For those willing to make the 1 1/2 hour or so drive from the Charleston area for a different golfing experience, this is the place to go. The course was very well maintained and the pace of play was better than most, especially considering that we played on a holiday weekend. The greens were a bit slower than average but were in very good condition. This is NOT a pumpkin patch golf course... it would fit in beautifully in any setting in the Charleston area. But then the cost to play would go up signifcantly! Do yourself and your wallet a favor. Get three golf buddies and make the trip to Wyboo. I'm sure you'll be impressed with the quality of the course and the great value!",
      "A bit out of the way but worth the drive. A fun course that is playable for the average golfer. Course was in great condition.",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "Beautiful morning for golf, and course was in very good shape. Had the first tee time, so round played quickly.",
      "My wife and I have played this course several times over the years. First time was several years ago on a golf package and now we live less than a hour away. Always in great shape and the prices in the summer are great and even better with Golfnow.com. If you're heading north or south on Interstate 95 stop in Manning SC and make this one of your regular stops. The course across the street is nice too and just south of Manning in Santee, home of 3 other nice tracks.",
      "I shot an 89 my second time playing this course. I love the greens and the way they hold good shots and how they putt. I shot 7 to 10 shots better than I have been scoring on some other courses. The fairways are in great shape too. It is just a very nice golf course.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "First time playing Wyboo and was very impressed by the layout and condition of the course. The natural landscape bordering the fairways significantly added to the beauty of the course. Nice to not see houses lining every fairway. Highly recommend this course and certainly will play it again.",
      "The guys in the clubhouse are really nice and helpful. The course couldn't be in better shape. Look forward to playing again this weekend.",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Love the course and it's layout. Hope to play next year Regards",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "Recommend It was a really nice layout and the course was in great shape.",
      "Enjoyed the course. Pace little slow but was a holiday weekend.",
      "Nice layout and price cannot be beat. Will go back again",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  },
  "Green Complexity": {
    "count": 16,
    "values": [
      -0.2,
      0.8,
      1.0,
      0.5,
      0.5,
      0.5,
      -0.5,
      0.5,
      0.5,
      1.0,
      0.5,
      1,
      -0.2,
      1.0,
      0.5,
      0.5
    ],
    "review_texts": [
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "Played over the weekend for the first time and was excited since I have been told by numerous people that Wyboo is the best course in the Santee Cooper Region. It's in the Top 3 of the courses I have played in the area. Very little undulation on the greens makes it easier for armatures, but layout makes if challenging for good golfers.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "Course is in great shape considering all the rain - greens are tricky!",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "Staff was super friendly. Had some interesting holes, with small challenging greens. Course was in good shape for this time of year.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  },
  "Driving Range": {
    "count": 3,
    "values": [
      1.0,
      1,
      1
    ],
    "review_texts": [
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Putting & Short Game Areas": {
    "count": 3,
    "values": [
      1,
      1,
      0.5
    ],
    "review_texts": [
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Tee to green is very forgiving if your a 10-15 handicap. This time of season the rough is shorter and makes for easier chip/pitch shots to get close. Greens were awesome. Really held the ball when properly struck. Had a great time and will go back soon. Charleston needs to hire this greens keeper and crew."
    ]
  },
  "Availability": {
    "count": 33,
    "values": [
      -0.5,
      0.5,
      1.0,
      1,
      -1,
      -0.5,
      0.5,
      0.9,
      1.0,
      -0.5,
      1,
      0.5,
      0.5,
      0.5,
      -1,
      1.0,
      1.0,
      -0.5,
      -1,
      1,
      1.0,
      0.9,
      1.0,
      0.7,
      1,
      1,
      0.5,
      0.5,
      1.0,
      -1,
      -0.5,
      0.5,
      1.0
    ],
    "review_texts": [
      "Called for tee times but ran in to many member groups (custom carts)out playing back nine causing delays each hole . They obviously started on back nine which apparently management allowed. Why call for tee times when you can not play through at the turn in the order you started the round? Course was not in very good shape overall.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Booked a tee time on golf now on Friday afternoon and drove 2 hours on Saturday morning to get to the course to find out it was closed",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Great course, lay out was easy to play as it being our first time there. We started on the back nine and it felt like it was our personal course. Did not see anyone to the 17th hole. Would definitely play there again.",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This is a hidden gem. To me, this is the nicest course I have ever played. But the only way I can play Wyboo is if I book it through GolfNow or TeeOff.com. On a pastors salary, I can't pay full price. Playing golf is such a great stress relief for me as a pastor. Thankful for the opportunity to have played Wyboo now for the 5th time.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "The greens were recently punched and covered in sand, so putting was impossible, BUT it stated that on GolfNow before we booked. Very neat course with a nice layout. I would like to go back and play when the greens are normal.",
      "Fairly forgiving but not boring course. In fine condition, and rates have plummeted as tourist season moves into lowcountry hot season. Not located near anywhere, but worth a longer drive than you might be used to.",
      "course was over booked, and underprepared,, course conditions were very good.. the overall experience however would make it difficult for me to recommend to a friend",
      "We love this course because it is never overly busy so our junior golfer gets time to play and we have time to teach her.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "had to call golf now to verify that I paid online they would not let me go out and play until I verified it ,the members on a golf course would not let me pass I have to skip two holes to get in front of them I still discriminated against",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "Fairways and greens were in excellent condition. We play a lot of different courses in the area and this one was the best we played this year. Course was not busy at all.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Beautiful morning for golf, and course was in very good shape. Had the first tee time, so round played quickly.",
      "My wife and I have played this course several times over the years. First time was several years ago on a golf package and now we live less than a hour away. Always in great shape and the prices in the summer are great and even better with Golfnow.com. If you're heading north or south on Interstate 95 stop in Manning SC and make this one of your regular stops. The course across the street is nice too and just south of Manning in Santee, home of 3 other nice tracks.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "Booked a tee time on golf now on Friday afternoon and drove 2 hours on Saturday morning to get to the course to find out it was closed",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "We love this course because it is never overly busy so our junior golfer gets time to play and we have time to teach her."
    ]
  },
  "Snack Bar-1, Snack Bar w/ Alcohol-2, Grill w/ Alcohol-3, Full Bar & Lounge-4, Full Service Restaurant-5": {
    "count": 3,
    "values": [
      1,
      1,
      1
    ],
    "review_texts": [
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing."
    ]
  },
  "Locker room & Showers": {
    "count": 1,
    "values": [
      1
    ],
    "review_texts": [
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Pro-shop": {
    "count": 12,
    "values": [
      1,
      0.5,
      -0.5,
      -0.5,
      -0.5,
      1.0,
      1,
      0.5,
      -0.5,
      -0.5,
      -0.5,
      1.0
    ],
    "review_texts": [
      "Our group of 17 had a great time. Very fair but not easy layout. Very good conditions and the people in the Pro Shop and Snack Bar were great!",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back."
    ]
  },
  "Staff Friendliness, After-Round Experience": {
    "count": 64,
    "values": [
      1.0,
      1,
      1,
      1.0,
      -0.5,
      1.0,
      0.5,
      1,
      1.0,
      0.5,
      -1,
      -0.5,
      -0.5,
      -0.5,
      1.0,
      1.0,
      -0.5,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      -1,
      1.0,
      0.9,
      1.0,
      1.0,
      1.0,
      -0.5,
      1,
      1.0,
      1,
      0.5,
      1.0,
      1.0,
      1.0,
      0.5,
      0.5,
      1.0,
      0.5,
      0.5,
      0.5,
      0.5,
      -1,
      -0.5,
      0.5,
      -0.5,
      -0.5,
      1.0,
      1.0,
      0,
      -0.5,
      0.5,
      1.0,
      1.0,
      1.0
    ],
    "review_texts": [
      "Overall conditions were good. Fairways were nice greens were a touch slow but in good shape . Great value and very friendly staff",
      "Course is in great shape overall and staff is friendly. Only drawback is that the bunkers only have about an inch of sand then you hit clay.",
      "Our group of 17 had a great time. Very fair but not easy layout. Very good conditions and the people in the Pro Shop and Snack Bar were great!",
      "Great golf course drove 1 1/2 hours play and was not disappointed,  fairways and greens in Great shape,  awesome staff",
      "Called for tee times but ran in to many member groups (custom carts)out playing back nine causing delays each hole . They obviously started on back nine which apparently management allowed. Why call for tee times when you can not play through at the turn in the order you started the round? Course was not in very good shape overall.",
      "This hidden gem is well worth the short ride from I-95 The course was well maintained Wwth a pretty and fair layout using four different tee boxes. Greens are in excellent condition and were very Consistent throughout. Great value and great experience. Friendly people.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Friendly staff, course in great conditions and greens in great condition. I would definitely play this course again.",
      "Fairways and greens were in great shape and the people were awesome",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "First to the Grounds Super and Crew… outstanding job! This is a very nice course in great shape. It’s easy to tell that this maintenance crew knows what they are doing and the course played spectacular tee to green. Now to the problems. The staff was very rude and unprofessional. The locals had set up a party literally just a couple of yards off the 18th green and wouldn’t move. We waited for a while and gestured for them to move so that we could hit , bit they wouldn’t. They just became very loud and boisterous so we just picked up and left without finishing or making things worse. It was too bad because everyone was playing well and we were all within a couple of strokes apart Not being able to finish our round was very disappointing. I’ll never go back here as there are so many other options.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "Staff was very friendly and helpful. The only issue was that they were redoing the greens so they did a make shift for now. They did tell us this before we started. They did tell us that it would be back to normal by next week. We willl return as it is a really good course",
      "Located on the North shore of Lake Marion course is about an hour drive but well worth the trip. Fairway grass was dormant but well cut, rough was dormant and cut just enough to make finding the short grass meaningful. Between loose leave and light brown rough , balls in the rough were sometimes hard to find. Green were in good shape, rolled true and were on the fast side. Staff was very friendly.. Thoroughly enjoyed the round. This is a course that I want to go back to when things are green and growing.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Course was in fantastic shape. Staff was very friendly and helpful. Fairways and greens were in fastastic shape. Highly recommend this course to anyone in the area.",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "Enjoyed playing this course. Well maintained, somewhat challenging, friendly staff.",
      "We really have enjoyed this course. This is the second time we have played this course, the first time was a few years ago. We decided in the last minute to head south for a overnight trip. Everyone treated us very nice and the course was in very nice shape. A little wet in a few spots but that was not the courses fault. We will be back again. Nice job Wyboo.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "We played this course while visiting friends and it was a pleasant surprise. Everyone was friendly and we were really impressed with the decked out golf carts. We will definitely visit this course again when we are in that area!",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff",
      "Had a lot of fun playing this course. The course is very well maintained. The greens are quick and in great shape. Really nice lay out. Staff is great and super friendly.",
      "Good condition, good fairways and greens for this time of year. FRIENDLY STAFF",
      "Last day of February. Course was in nice shape. Pro shop staff extremely friendly.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "had to call golf now to verify that I paid online they would not let me go out and play until I verified it ,the members on a golf course would not let me pass I have to skip two holes to get in front of them I still discriminated against",
      "Great course. Staff very friendly and helpful. Conditions were fantastic.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "We played 36 holes and had a ball. Everyone was very nice and the course was in FINE shape for this time of year.",
      "Staff was super friendly. Had some interesting holes, with small challenging greens. Course was in good shape for this time of year.",
      "A great course with a welcome feel. The gentleman behind the counter on 10/30/13 couldn't have been nicer or more accommodating. We'll be back for sure!",
      "Staff friendliness listed on golf now as excellent. Maybe they were having a bad day but the friendliness was definitely not there on our day. The course was not in pristine condition as we were led to believe. I would not recommend this course to a friend.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Tee to green is very forgiving if your a 10-15 handicap. This time of season the rough is shorter and makes for easier chip/pitch shots to get close. Greens were awesome. Really held the ball when properly struck. Had a great time and will go back soon. Charleston needs to hire this greens keeper and crew.",
      "The guys in the clubhouse are really nice and helpful. The course couldn't be in better shape. Look forward to playing again this weekend.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Girdem\n09/25/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nSomewhat Challenging",
      "u253773198\n09/10/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "WW1952\n09/08/2023 - Verified Purchase\n\nHandicap: 20-24 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nModerate",
      "awilkerson1992\n07/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "aaflesher\n02/22/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "u000007668627\n02/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "wabsher\n01/16/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nAverage\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "u314163629608\n01/01/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "mbonneau\n11/21/2022 - Verified Purchase\n\nHandicap: 15-19 Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nSomewhat Challenging",
      "Havogt\n09/15/2022 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nPoor\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "realtime99\n07/25/2022 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "Love playing this course. Just wish the pro would greet you when you walk in the pro shop. It’s almost like it’s a bother for him to check you in. Other then that the course is in great shape. Love the new greens.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "u878962002\n12/10/2021 - Verified Purchase\n\nHandicap: 15-19 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nSomewhat Challenging",
      "aaflesher\n01/30/2021 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nGood\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "u541101664\n11/27/2020 - Verified Purchase\n\nHandicap: n/a Plays: Once a month\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nAverage\nValue for the Money:\nGood\nOff-Course Amenities:\nFair\nCourse Difficulty:\nn/a",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "u000007233588\n10/14/2018 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nPoor\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "- in good shape greens excellent. -nice layout good variety of doglegs -friendly staff"
    ]
  },
  "Eco-friendless and sustainability": {
    "count": 1,
    "values": [
      1
    ],
    "review_texts": [
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Course History": {
    "count": 1,
    "values": [
      1
    ],
    "review_texts": [
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Architect": {
    "count": 1,
    "values": [
      1
    ],
    "review_texts": [
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Green Fees vs. Quality": {
    "count": 71,
    "values": [
      0.9,
      1.0,
      1,
      0.5,
      1.0,
      1.0,
      0.9,
      1.0,
      1.0,
      0.5,
      0.5,
      -0.5,
      1.0,
      0.5,
      1,
      1.0,
      0.5,
      0.8,
      0.5,
      1,
      1.0,
      1,
      1.0,
      1.0,
      0.5,
      1.0,
      1,
      1,
      1,
      0.5,
      1.0,
      0.8,
      1,
      1,
      1,
      1.0,
      1.0,
      0.7,
      -0.5,
      1.0,
      1.0,
      0.5,
      1.0,
      1,
      1,
      0.8,
      1.0,
      1.0,
      1.0,
      1.0,
      0.5,
      0.5,
      1.0,
      1.0,
      0,
      0.5,
      0.5,
      1.0,
      1,
      1.0,
      1.0,
      1.0,
      1.0,
      0.5,
      0.5,
      0.5,
      1.0,
      0.5,
      1.0,
      1.0,
      1.0
    ],
    "review_texts": [
      "Overall conditions were good. Fairways were nice greens were a touch slow but in good shape . Great value and very friendly staff",
      "This hidden gem is well worth the short ride from I-95 The course was well maintained Wwth a pretty and fair layout using four different tee boxes. Greens are in excellent condition and were very Consistent throughout. Great value and great experience. Friendly people.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "A lovely course that was excellent value for money. Having played some big name courses in South Carolina, playing Wyboo was enjoyable. Some well designed holes that kept the round interesting. The greens were excellent and even though we had a splash of rain, the greens could take the moisture and putted perfectly. Worth a visit in the area.",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "This was our first time playing this course. Although it was November 2, and considered \"late\" in the season, the course was in very good condition! We will definitely put this one on our return to play list.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "Nice layout and price cannot be beat. Will go back again",
      "Staff was very friendly and helpful. The only issue was that they were redoing the greens so they did a make shift for now. They did tell us this before we started. They did tell us that it would be back to normal by next week. We willl return as it is a really good course",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "We played the course during a time when the greens were under construction. They have tiny temporary green set up with large cups. The overall course was beautiful! It played nicely. I just wish for the price we paid we’d have been informed prior to purchasing that the course was undergoing renovation.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Golf now did not flag course maintenance. Besides greens being worked on course was in good shape. Played here before and will play here again",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This is a hidden gem. To me, this is the nicest course I have ever played. But the only way I can play Wyboo is if I book it through GolfNow or TeeOff.com. On a pastors salary, I can't pay full price. Playing golf is such a great stress relief for me as a pastor. Thankful for the opportunity to have played Wyboo now for the 5th time.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "Wyboo is the best course for the money that I have been on.",
      "This course was a great surprise.Great layout and in good shape for the time of year.Pacewas average but still okay.Would definitely play again and highly recommend.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "Love to play this course. It's an hour ride away from me but I don't mind the drive for a good course. The layout is great, the greens are always in good shape. Great value for the price. I played this course for $23 but would've paid $50 and still would be a good price. I have played high priced courses in the Charleston area that pale to comparison to this course.",
      "Fairly forgiving but not boring course. In fine condition, and rates have plummeted as tourist season moves into lowcountry hot season. Not located near anywhere, but worth a longer drive than you might be used to.",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "I love playing this course. Club does a great job keeping this course in playing condition. I have now played it about a dozen times and never have been disappointed.",
      "I play this course 2 or 3 times a month and I have to drive 50 miles to get there. It is always in great shape and the price is very reasonable.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "Definitely will play here again. Nice course for the money.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Wyboo is always in great shape. Well worth the trip!",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "This place is a hidden gem. Well worth the money and time. I only wish it was closer to where I live because I would play every week.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "Course is in very good condition, all the greens and fairways were in good shape. Great value for the money at this time of year.",
      "We enjoyed the course very much - it had some challenging holes - the greens were very smooth, even though it's off season. The only thing that we can think of to look after - there was little or no water in the ball washers on the course and the drying towels are very old and filthy. Little things like this get noticed and it doesn't take money or hard labor to rectify this. Overall though, we had a great time and look forward to a return visit.",
      "Staff friendliness listed on golf now as excellent. Maybe they were having a bad day but the friendliness was definitely not there on our day. The course was not in pristine condition as we were led to believe. I would not recommend this course to a friend.",
      "wide fairways, plenty of water, greens in really good shape for the time of year, a great deal, a great day!",
      "For those willing to make the 1 1/2 hour or so drive from the Charleston area for a different golfing experience, this is the place to go. The course was very well maintained and the pace of play was better than most, especially considering that we played on a holiday weekend. The greens were a bit slower than average but were in very good condition. This is NOT a pumpkin patch golf course... it would fit in beautifully in any setting in the Charleston area. But then the cost to play would go up signifcantly! Do yourself and your wallet a favor. Get three golf buddies and make the trip to Wyboo. I'm sure you'll be impressed with the quality of the course and the great value!",
      "A bit out of the way but worth the drive. A fun course that is playable for the average golfer. Course was in great condition.",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "My wife and I have played this course several times over the years. First time was several years ago on a golf package and now we live less than a hour away. Always in great shape and the prices in the summer are great and even better with Golfnow.com. If you're heading north or south on Interstate 95 stop in Manning SC and make this one of your regular stops. The course across the street is nice too and just south of Manning in Santee, home of 3 other nice tracks.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "The greens were in fantastic shape and the fairways were also in excellent condition. For the money, this is the best course I have ever played! Highly recommended.",
      "Girdem\n09/25/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nSomewhat Challenging",
      "u253773198\n09/10/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "WW1952\n09/08/2023 - Verified Purchase\n\nHandicap: 20-24 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nModerate",
      "awilkerson1992\n07/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "aaflesher\n02/22/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "u000007668627\n02/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "wabsher\n01/16/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nAverage\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "u314163629608\n01/01/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "mbonneau\n11/21/2022 - Verified Purchase\n\nHandicap: 15-19 Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nSomewhat Challenging",
      "New greens are fabulous! Overall condition of the course is very good. Great value for the price",
      "Havogt\n09/15/2022 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nPoor\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "realtime99\n07/25/2022 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "u878962002\n12/10/2021 - Verified Purchase\n\nHandicap: 15-19 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nSomewhat Challenging",
      "Nice layout and price cannot be beat. Will go back again",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "aaflesher\n01/30/2021 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nGood\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "u541101664\n11/27/2020 - Verified Purchase\n\nHandicap: n/a Plays: Once a month\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nAverage\nValue for the Money:\nGood\nOff-Course Amenities:\nFair\nCourse Difficulty:\nn/a",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "u000007233588\n10/14/2018 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nPoor\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  },
  "Replay Value": {
    "count": 80,
    "values": [
      1.0,
      0.5,
      1,
      1.0,
      1,
      0.8,
      1,
      0.5,
      1.0,
      1.0,
      -1,
      0.8,
      1.0,
      1.0,
      1.0,
      0.5,
      0.9,
      0.5,
      0.5,
      1.0,
      1,
      1.0,
      1.0,
      0.5,
      0.9,
      1.0,
      0.9,
      1.0,
      1,
      1,
      1.0,
      0.8,
      1.0,
      1.0,
      0.5,
      1.0,
      -1,
      1.0,
      1,
      1,
      1,
      0.5,
      1.0,
      0.8,
      1,
      1,
      0.8,
      0.5,
      0.8,
      0.5,
      1,
      1,
      1.0,
      -0.5,
      1.0,
      1.0,
      1.0,
      1,
      1,
      1.0,
      0.6,
      1,
      1.0,
      1,
      1.0,
      1.0,
      1.0,
      1.0,
      0.5,
      1.0,
      0.5,
      1.0,
      1.0,
      0.5,
      0.5,
      0.5,
      0.5,
      1.0,
      1.0,
      1.0
    ],
    "review_texts": [
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Friendly staff, course in great conditions and greens in great condition. I would definitely play this course again.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Love the course and it's layout. Hope to play next year Regards",
      "A lovely course that was excellent value for money. Having played some big name courses in South Carolina, playing Wyboo was enjoyable. Some well designed holes that kept the round interesting. The greens were excellent and even though we had a splash of rain, the greens could take the moisture and putted perfectly. Worth a visit in the area.",
      "Wyboo is a fantastic course. The greens are mint, light undulations not to small, and 90% pure throughout. Grass range, so you can actually warm up!! Open enough that all the twists and turns don't equal 20 lost balls if u play aggressive. Love coming out here",
      "This was our first time playing this course. Although it was November 2, and considered \"late\" in the season, the course was in very good condition! We will definitely put this one on our return to play list.",
      "First to the Grounds Super and Crew… outstanding job! This is a very nice course in great shape. It’s easy to tell that this maintenance crew knows what they are doing and the course played spectacular tee to green. Now to the problems. The staff was very rude and unprofessional. The locals had set up a party literally just a couple of yards off the 18th green and wouldn’t move. We waited for a while and gestured for them to move so that we could hit , bit they wouldn’t. They just became very loud and boisterous so we just picked up and left without finishing or making things worse. It was too bad because everyone was playing well and we were all within a couple of strokes apart Not being able to finish our round was very disappointing. I’ll never go back here as there are so many other options.",
      "Pace of play was a tad slow but not enough to ruin the round. Course was in great shape. Greens rolled true and fairways were solid. Would play again.",
      "Nice layout and price cannot be beat. Will go back again",
      "Staff was very friendly and helpful. The only issue was that they were redoing the greens so they did a make shift for now. They did tell us this before we started. They did tell us that it would be back to normal by next week. We willl return as it is a really good course",
      "After a short rain delay, my husband and I really enjoyed playing here. Considering that there hasn't been much rain lately, the course was in good condition and the greens were quick as expected. Course was challenging and pace of play was great! This was the 1st time playing this course and we'll definitely be back!",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "Located on the North shore of Lake Marion course is about an hour drive but well worth the trip. Fairway grass was dormant but well cut, rough was dormant and cut just enough to make finding the short grass meaningful. Between loose leave and light brown rough , balls in the rough were sometimes hard to find. Green were in good shape, rolled true and were on the fast side. Staff was very friendly.. Thoroughly enjoyed the round. This is a course that I want to go back to when things are green and growing.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Played the course in very windy, cold, and wet conditions. Brutal round due to conditions but course was in good shape. Greens and fairways were in good shape for all the rain the area has had. Would play again and would recommend.",
      "Great course, lay out was easy to play as it being our first time there. We started on the back nine and it felt like it was our personal course. Did not see anyone to the 17th hole. Would definitely play there again.",
      "Played here again as part of a package in Santee. Definitely the best conditioned course of our trip and totally worth the short drive. Tee to green course is in amazing shape. MOST of the bunkers are in good shape, but there are some that took a hit from Hurricane Michael which will take some time to fix. Greens rolled well with no real imperfections to speak of. Clubhouse is no frills, which is perfect. Took advantage of the replay opportunity and played another 18. This course is a must-play when you're in Santee.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Great layout. Fairways in excellent condition. Greens had been recently plugged. Would like to play it again when greens are completely healed. Enjoyed he course very much. Bunkers needed a lot of work.",
      "Golf now did not flag course maintenance. Besides greens being worked on course was in good shape. Played here before and will play here again",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "This is a great course and a fun track. We liked the conditioning and layout so much that we went back to Wyboo in our short, four-day trip. We played another course on our last day, but felt that Wyboo was soooooo much better that we left after just one round (we normally play 2-3 rounds on the same course) and went back to Wyboo.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "This is a hidden gem. To me, this is the nicest course I have ever played. But the only way I can play Wyboo is if I book it through GolfNow or TeeOff.com. On a pastors salary, I can't pay full price. Playing golf is such a great stress relief for me as a pastor. Thankful for the opportunity to have played Wyboo now for the 5th time.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "This course was a great surprise.Great layout and in good shape for the time of year.Pacewas average but still okay.Would definitely play again and highly recommend.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "We really have enjoyed this course. This is the second time we have played this course, the first time was a few years ago. We decided in the last minute to head south for a overnight trip. Everyone treated us very nice and the course was in very nice shape. A little wet in a few spots but that was not the courses fault. We will be back again. Nice job Wyboo.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "We played this course while visiting friends and it was a pleasant surprise. Everyone was friendly and we were really impressed with the decked out golf carts. We will definitely visit this course again when we are in that area!",
      "The greens were recently punched and covered in sand, so putting was impossible, BUT it stated that on GolfNow before we booked. Very neat course with a nice layout. I would like to go back and play when the greens are normal.",
      "Love to play this course. It's an hour ride away from me but I don't mind the drive for a good course. The layout is great, the greens are always in good shape. Great value for the price. I played this course for $23 but would've paid $50 and still would be a good price. I have played high priced courses in the Charleston area that pale to comparison to this course.",
      "course was over booked, and underprepared,, course conditions were very good.. the overall experience however would make it difficult for me to recommend to a friend",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "I love playing this course. Club does a great job keeping this course in playing condition. I have now played it about a dozen times and never have been disappointed.",
      "I play this course 2 or 3 times a month and I have to drive 50 miles to get there. It is always in great shape and the price is very reasonable.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "Definitely will play here again. Nice course for the money.",
      "Fairways had not come into their own due to slow warming this spring. The greens were tough to find a comfortable speed on again probably due to slow growth. Overall the course is great with a good no nonsense layout. I highly recommend it.",
      "Played Wyboo for the first time today and loved it. Great track in fantastic shape tee to green. We enjoyed the course design and thought it was challenging yet a very fair test. I live 40 minutes away and will definitely come back as often as possible.",
      "This place is a hidden gem. Well worth the money and time. I only wish it was closer to where I live because I would play every week.",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "We enjoyed the course very much - it had some challenging holes - the greens were very smooth, even though it's off season. The only thing that we can think of to look after - there was little or no water in the ball washers on the course and the drying towels are very old and filthy. Little things like this get noticed and it doesn't take money or hard labor to rectify this. Overall though, we had a great time and look forward to a return visit.",
      "We played 36 holes and had a ball. Everyone was very nice and the course was in FINE shape for this time of year.",
      "Well maincured greens and fairways, rough was a little tall. The course was busy but speed of play was good. Electric carts a plus. Would enjoy playing this course again with family and friends.",
      "I play every weekend using golf now I have to say I really wish this course was close to me I would spend most of my weekends there. If you are considering this course for the first time go I can't describe it we'll enough for you but you will most definitely enjoy it. It was beautifully maintained and loved the course layout.",
      "A great course with a welcome feel. The gentleman behind the counter on 10/30/13 couldn't have been nicer or more accommodating. We'll be back for sure!",
      "Staff friendliness listed on golf now as excellent. Maybe they were having a bad day but the friendliness was definitely not there on our day. The course was not in pristine condition as we were led to believe. I would not recommend this course to a friend.",
      "For those willing to make the 1 1/2 hour or so drive from the Charleston area for a different golfing experience, this is the place to go. The course was very well maintained and the pace of play was better than most, especially considering that we played on a holiday weekend. The greens were a bit slower than average but were in very good condition. This is NOT a pumpkin patch golf course... it would fit in beautifully in any setting in the Charleston area. But then the cost to play would go up signifcantly! Do yourself and your wallet a favor. Get three golf buddies and make the trip to Wyboo. I'm sure you'll be impressed with the quality of the course and the great value!",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Played this course for the first time this weekend and loved it! Course very well maintained with soft fairways and greens that were a pleasure to hit on. Course had hazards all over that made choosing the right club a little more important but still a joy to play for inexperienced golfers. A+++++",
      "My wife and I have played this course several times over the years. First time was several years ago on a golf package and now we live less than a hour away. Always in great shape and the prices in the summer are great and even better with Golfnow.com. If you're heading north or south on Interstate 95 stop in Manning SC and make this one of your regular stops. The course across the street is nice too and just south of Manning in Santee, home of 3 other nice tracks.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Really enjoyed playing this course, actually have booked another tee time for this week. The fairways and greens were really well kept.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "First time playing Wyboo and was very impressed by the layout and condition of the course. The natural landscape bordering the fairways significantly added to the beauty of the course. Nice to not see houses lining every fairway. Highly recommend this course and certainly will play it again.",
      "Tee to green is very forgiving if your a 10-15 handicap. This time of season the rough is shorter and makes for easier chip/pitch shots to get close. Greens were awesome. Really held the ball when properly struck. Had a great time and will go back soon. Charleston needs to hire this greens keeper and crew.",
      "The guys in the clubhouse are really nice and helpful. The course couldn't be in better shape. Look forward to playing again this weekend.",
      "Challenging but fair. Would definitely play again and recommend to friends.",
      "I have played every course in the area, but haven't played this one since it first opened years ago. Let me tell you, It is in awesome shape. Greens were perfect ( about a 10/11 0n the stimp meter. Fairways were perfect. Not too wide, not too narrow. I shot my 2nd lowest score of the year. I'm going back next weekend.",
      "The greens were in fantastic shape and the fairways were also in excellent condition. For the money, this is the best course I have ever played! Highly recommended.",
      "The course was in very nice condition for early December. The tee's were over seeded, the fairways dormant and the greens had been dyed for the winter. When we played the weather was mostly clear, in the 50's and light wind so \"perfect\" for South Carolina and December. We will play this one again!",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Love the course and it's layout. Hope to play next year Regards",
      "Nice layout and price cannot be beat. Will go back again",
      "Nice golf course. However they are redoing the greens and all greens are temporary. We were told not all were temporary. So a little disappointed. But appears to be nice course and would be worth the money.",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "Not near or on the way to any real place; Greater Charleston residents have to want to go there, and out-of-towners play as part of packages with other area courses.. Price for local rate is excellent, and improves as weather gets hotter. Nice layout, very good conditions. Not overly difficult, but not a giveaway course, and not at all dull.",
      "Have been coming to South Carolina to golf on our way to Florida for many years now and finally played Wyboo today. Very much enjoyed the course, even though it was a bit wet, however it would be nice if they gave the ladies something more than 85-100 yards on a par 3, and leveling the red tee boxes would be nice as well. Also didn't encounter very much southern hospitality from the gentleman in the pro shop, and we also did not like being sold cold hotdogs after the 9th, and right at lunch hour.... but the course is worth playing.",
      "Played this course in late September after the hurricane. This was the best course of the three we played in our package. We played 36 holes. Course is in great shape and the greens are excellent. Bermuda greens are tricky. Loved this track and will play it again. You will not go wrong playing here, although it is a little out of the way (40 min drive) from Santee.",
      "Our first impression was terrific at the pro shop with very friendly and helpful staff. The starter was warm, welcoming, informative and funny. The course was in excellent shape with tip top tee boxes and rich green, well manicured fairways. The greens rolled true. It was a GREAT experience and we’ll recommend to friends and come back.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  },
  "Ease of Walking": {
    "count": 4,
    "values": [
      -0.5,
      -0.5,
      1.0,
      1
    ],
    "review_texts": [
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "We had cart path only because it was so wet. The course is in very nice condition. Would play again but not if it is cart path only.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "I believe this is the best golf course I have ever played. I like everything about it."
    ]
  },
  "Pace of Play": {
    "count": 55,
    "values": [
      -0.5,
      0.5,
      1.0,
      0.5,
      -0.5,
      -1,
      1.0,
      -0.2,
      -0.2,
      -0.5,
      1.0,
      1,
      -0.5,
      1.0,
      -0.5,
      1.0,
      1,
      0,
      1.0,
      -1,
      1.0,
      1,
      -0.5,
      -1,
      -0.5,
      0.5,
      1,
      0.9,
      1.0,
      0.9,
      1,
      -0.3,
      0.5,
      1.0,
      0.0,
      0.0,
      1.0,
      0.5,
      -0.5,
      -1,
      1.0,
      1.0,
      0.5,
      0.5,
      0.5,
      1,
      1.0,
      -0.2,
      -0.5,
      1.0,
      0.0,
      -0.5,
      0,
      -1.0,
      1.0
    ],
    "review_texts": [
      "Called for tee times but ran in to many member groups (custom carts)out playing back nine causing delays each hole . They obviously started on back nine which apparently management allowed. Why call for tee times when you can not play through at the turn in the order you started the round? Course was not in very good shape overall.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "I've played almost every course in the state of SC and this is always one of my favorite places to play. The course layout is great! It has a lot of holes that make you think and where to play your ball instead of just ripping the driver on every hole. Beautiful holes that are all different sizes and shapes and some elevation changes which do not exist not too far away. The course has always been in Country Club Conditions. This is great for something that is out in what most people would consider cow country. It's not overcrowded. I played behind some groups that were fairly backed up, so I was taking extra shots and worked on the short game on most greens to keep busy but still finished up in under 4 hours.",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Very slow play today, not usually an issue of Friday afternoons here. 4 players in front of us, could have playing for the first time ever...golf etiquette was non-existent...playing thru, never presented itself.",
      "I've been wanting to play this course for a while and having recently joined the GolfPASS/GolfNOW website eliminated any excuses for not giving it a try. I'm a solo player most of the time and found the course to be relaxing, quiet, fairway houses not too close, and in VERY GOOD condition. The only exception which downgraded course conditions were the active repairs of fungi damage to the greens. I was asked only once to hold my play while the groundsmen could finish up. I read some of the comments about the front desk/Club Pro not being pleasant. As it was my first time playing there I did have a few questions and often like to engage in small talk with the staff. This gentleman made me feel like I was a bother and couldn't wait to get my cart and get as far away from the Pro Shop as possible.",
      "Enjoyed the course. Pace little slow but was a holiday weekend.",
      "Pace of play was a tad slow but not enough to ruin the round. Course was in great shape. Greens rolled true and fairways were solid. Would play again.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "After a short rain delay, my husband and I really enjoyed playing here. Considering that there hasn't been much rain lately, the course was in good condition and the greens were quick as expected. Course was challenging and pace of play was great! This was the 1st time playing this course and we'll definitely be back!",
      "I played in March, early spring. Greens were only ok. Course is fairly basic - not a lot of trouble. Pace of play was very good.",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "Great course, lay out was easy to play as it being our first time there. We started on the back nine and it felt like it was our personal course. Did not see anyone to the 17th hole. Would definitely play there again.",
      "My golf partner and I have been playing everywhere over the last 10 plus years. We luck up & find some great courses and sometimes not so great courses. We live on the boarder of NC/SC, we went to a course that's close to us in SC. As we were approaching the course we saw bout 10 carts in line at the first tee, we knew we had to go somewhere else. We found Wyboo!!! Even though it was it took us a ride to get there, we didn't mind because it was a course we hadn't play before. At first, it looked like any other golf course. The guy inside was nice and friendly. He told us after we paid we could go off at when we were ready. Looked like they had plenty of rain seen a few puddles in a couple of fairways but it did affect play. A very nice layout from start to finish. The par 5s are long, have to be very carful where you hit your ball too. Hit what i thought was a perfect drive. Was in the fairway looking for my ball could not find it at all, the way it was turning to go to fairway was a pond right there. OUCH!!!! Everything is just wonderful about this course. It is a must play if you are in the area. Think we will be back before the summer is over.",
      "Really enjoyed this course. We made the 75 mile trip from Charleston I-26/I-95 for an 8:53 tee time. We arrived about an hour ahead and the staff allowed us to immediately get out ahead of 2 foursomes. That made for a great day without any waiting. The fairways were well maintained with very few tight lies. The rough was well maintained and cut a little shorter than most courses we play. A fairly flat course provided for mostly even lies. The greens rolled true and were about an 8. Most were side protected but offered wide approaches. Average number of doglegs but most were drivable. Some lateral water that was avoidable with well placed drives. The bunkers were soft and well maintained. We managed to get in 27 holes and our scoring went way down on the last 9. It might have simply been the day of the week but we felt as if we had the entire course to ourselves. I’m not suggesting the course is without challenge but there is enough forgiveness that it is well suited to all levels of ability. One thing I did find unusual was their no walking at any time policy. That goes for members as well. The cart paths are concrete and there are a number of areas that could use some attention. The carts are reliable but showing some age and wear I suspect as a result of that no walking policy. All in all we thoroughly enjoyed our round and will certainly plan another trip.",
      "Have been coming to Santee for a couple years now on an annual golf trip and were pleasantly surprised by Wyboo. Fairways and greens were in great shape and roughs were OK, as they are coming out of dormancy. We were probably 4 of a couple dozen on the course, and pace of play was quick. Definitely a no-frills experience and that's exactly what we needed. Took advantage of the replay deal with our package and played another 18. Wyboo is definitely not one to miss. Kudos to the grounds crew for keeping things playable through the winter, I'm sure the spring and summer will be top notch.",
      "This course was a great surprise.Great layout and in good shape for the time of year.Pacewas average but still okay.Would definitely play again and highly recommend.",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!",
      "course was over booked, and underprepared,, course conditions were very good.. the overall experience however would make it difficult for me to recommend to a friend",
      "I highly recommend this course. I played the course in early Sept 2016, and it was in excellent condition. Tee boxes and greens were well kept, and the fairways were exceptional. The course was not overly challenging, but not easy either. Bunkers in play on every whole, both fairway and around the greens. Not much water, but it is in play on a few holes. Fairways on the wider end, lots of sharp dog legs. Thick rough around the greens. I suspect one of the reasons that the course is in such great condition is that its in the middle of no where, and so my guess is it doesn't get a ton of traffic. I played on a nice day in early Sept, arrived a little before noon, jumped right on as a single and didn't have anyone behind me the entire round (and this was on a nice later summer day). The lack of crowd is definitely a positive in my book. Also, the price I paid for the round was just ridiculous. $10 for greens fees and a cart, and the course was in a condition that I would say is easily on par with many country clubs/ private courses. Steal of a deal. To sum it up, I was very impressed with this course. Its worth a bit of a drive, and I look forward to playing it again soon.",
      "My wife and I played this course and found it challenging, interesting and offered a fair advantage on the various tee boxes, very nice. The layout allowed one to push it hard off the tee if you desire a little risk or play to a spot for safety. We enjoyed the play on Independence day for a mid-morning round on a day in the upper 90's. There was drinking water on the course and simple snacks and sandwiches in the snack bar. The practice facility was first class, the course is well marked and maintained. The big drawback for us was that they had just aeriated the greens recently so putting was a little rough, but all in all we enjoyed this very quiet good pace of play course. It was worth a bit of a drive to get there, try it you will like it.",
      "This is such a fun course. Too bad all the rain has saturated so many courses this fall/winter. Great lay out with fairway bunkers on some holes and water on others. Lengthy and then some less in length. Greens in great shape and rolled true and speedier than they appear. Cart path runs across a number of fairways making \"cart path only\" more timely than most. Overall fairways were very playable. Staff very friendly as always.",
      "had to call golf now to verify that I paid online they would not let me go out and play until I verified it ,the members on a golf course would not let me pass I have to skip two holes to get in front of them I still discriminated against",
      "Booked my round with Golfnow as a single and found a great price. To begin the round, the other 3 in my group showed up late, we got off after I spoke with the two groups that were waiting and due to tee off after us. They were very courteous and understanding. On the course, from tee box to green, the course played well and was well maintained. Most Greens rolled true, but a divots were not repaired on a few. The only con I have for the round is that the pace of play was a little slow due to 1, the group I played with (2 were beginners) and 2, the amount of groups out on the course. There were a few challenging holes from the white tees, but will play the blues next time to challenging myself. Overall, I loved the course condition.",
      "We had a great afternoon playing Wyboo for the first time. The course is well laid out at 6395 yds from the whites with perfect over-seeded greens. The course has generously landing areas. I hit mostly driver with two 3-woods off the tee. The par 3s vary in length. The bunkers had a variety of soft and firm sand. Pace of play was fine on a Sat mid-day, finishing in 3:45'. I really enjoy flatter lay outs like Wyboo, and look forward to returning.",
      "Well maincured greens and fairways, rough was a little tall. The course was busy but speed of play was good. Electric carts a plus. Would enjoy playing this course again with family and friends.",
      "For those willing to make the 1 1/2 hour or so drive from the Charleston area for a different golfing experience, this is the place to go. The course was very well maintained and the pace of play was better than most, especially considering that we played on a holiday weekend. The greens were a bit slower than average but were in very good condition. This is NOT a pumpkin patch golf course... it would fit in beautifully in any setting in the Charleston area. But then the cost to play would go up signifcantly! Do yourself and your wallet a favor. Get three golf buddies and make the trip to Wyboo. I'm sure you'll be impressed with the quality of the course and the great value!",
      "This course was in very good shape except that the greens had been punched about 10 days earlier. My son and I played on a Thursday and had the entire course to ourselves. Not terribly challenging, but that's fine as we are both high handicappers. The fairways were great, but not a lot of sand in the few traps I visited. I would definitely play it again if the occasion arises. It is a bit out of the way.",
      "Beautiful morning for golf, and course was in very good shape. Had the first tee time, so round played quickly.",
      "I believe this is the best golf course I have ever played. I like everything about it.",
      "Coming from Charleston the drive is a bit long, good thing the deal was \"All U Can Play\". First 18 flew by, no one else around - peaceful on many holes, no homes, felt like it was just us out there. Condition of course is very good, winter rye in the fairways looked great (some soggy areas here and there), greens rolled very nicely and firm (very few divot marks), other areas around greens are worn down from cart traffic - guessing some people just drive where they like. Second 18 ran into delays starting on #3 and stayed that way, so much for etiquette allowing faster players through. Would like to do it again providing it's another \"All U Can Play\" deal, otherwise catch a round when traveling down 95.",
      "On our way to myrtle beach, we decided to play here as a tune up round. We arrived late but they accommodated us by letting us start on the back 9, which helped us to get through the course quickly. The course was in decent shape, but fairways and rough are in good shape. The greens played on the slow side, which was a negative mark on the scorecard. We definitely will play there again next year, before heading to myrtle.",
      "Girdem\n09/25/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nSomewhat Challenging",
      "u253773198\n09/10/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nExcellent\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "WW1952\n09/08/2023 - Verified Purchase\n\nHandicap: 20-24 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nAverage\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nModerate",
      "This was our first time playing this course. It was beautiful! Tee boxes and greens were well maintained. No one in front or behind us which made this golf experience PERFECT! Highly recommend this course.",
      "awilkerson1992\n07/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nn/a",
      "Got off on time. Guy in pro shop and starter were nice. Layout was nice. Seemed like par 3s were toughest holes. Water on half of holes. Plenty of traps which were ok. Course in good shape. Greens had been aerated, so a little tricky to putt. Marshall came by but there wasn’t much he could do. Pace was a little slow, around 4:15 and we were a twosome waiting every hole. Concern that they apparently allow fivesomes, which could slow it down more. (Sign says no 5 somes today) Big complaint was drinking water. No fountain in pro shop. Fountains on course didn’t work and no water jugs out. Happily it wasn’t too hot. Would definitely play again.",
      "Very slow play today, not usually an issue of Friday afternoons here. 4 players in front of us, could have playing for the first time ever...golf etiquette was non-existent...playing thru, never presented itself.",
      "aaflesher\n02/22/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "u000007668627\n02/09/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "wabsher\n01/16/2023 - Verified Purchase\n\nHandicap: n/a Plays: n/a\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nAverage\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "u314163629608\n01/01/2023 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "mbonneau\n11/21/2022 - Verified Purchase\n\nHandicap: 15-19 Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nGood\nCourse Conditions:\nAverage\nStaff Friendliness:\nGood\nValue for the Money:\nGood\nOff-Course Amenities:\nAverage\nCourse Difficulty:\nSomewhat Challenging",
      "Havogt\n09/15/2022 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nPoor\nValue for the Money:\nExcellent\nOff-Course Amenities:\nn/a\nCourse Difficulty:\nn/a",
      "realtime99\n07/25/2022 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nExcellent\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "Enjoyed the course. Pace little slow but was a holiday weekend.",
      "New greens makes playing golf even more fun. They roll true. The speeds from green to green are consistent. Well worth playing. Only thing is if you get behind members prepare for a long round as they won’t let players though",
      "u878962002\n12/10/2021 - Verified Purchase\n\nHandicap: 15-19 Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nExcellent\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nSomewhat Challenging",
      "aaflesher\n01/30/2021 - Verified Purchase\n\nHandicap: n/a Plays: A few times a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nExcellent\nValue for the Money:\nGood\nOff-Course Amenities:\nExcellent\nCourse Difficulty:\nn/a",
      "The course is very enjoyable to play. We play it frequently. Today was incredibly frustrating. During our round as a foursome we had to let 5 twosomes play through. Don’t understand why when the course is that busy they didn’t put groups together to make foursomes. It would have been a great boost to the pace of play and much less frustrating for the foursomes that we’re playing.",
      "u541101664\n11/27/2020 - Verified Purchase\n\nHandicap: n/a Plays: Once a month\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nFair\nCourse Conditions:\nGood\nStaff Friendliness:\nAverage\nValue for the Money:\nGood\nOff-Course Amenities:\nFair\nCourse Difficulty:\nn/a",
      "u000007233588\n10/14/2018 - Verified Purchase\n\nHandicap: n/a Plays: Once a week\n\n Recommend\n\nComment\n\n18 Hole Pace of Play:\nPoor\nCourse Conditions:\nGood\nStaff Friendliness:\nGood\nValue for the Money:\nExcellent\nOff-Course Amenities:\nGood\nCourse Difficulty:\nn/a",
      "This was my first time playing Wyboo and to be honest, I wasn't expecting much for a $9.00 round of golf. The greens had been aerated a couple of months before we played so again, I wasn't expecting anything great...but for such a cheap price I thought, what the heck. We arrived a bit late but the staff was extremely friendly and helpful. There was an issue with the address listed on the GolfNow App and the actual physical address of the course. The staff was totally understanding and had no problem with us going off a bit late. The course was in phenomenal shape! The greens were decent considering the recent aeration. Every putt was mostly straight but the greens were definitely still playable. It was challenging enough for an average golfer, but not too challenging where you could lose a ball every hole. I'd love to come back when the greens were perfect to get a better idea of the actual quality of play. The course is located a bit far away from any city life, but that made for a quick paced round and an overall enjoyable experience. Honestly, I would have had no problem paying $20-$30 to play this course, even with the condition of the greens. If you get a deal on a discount app, take it! You will not be disappointed!"
    ]
  }
}